When there are issues during communication in the application that uses BDT, besides checking the logs, debugging tools can also be used to troubleshoot problems.

# 1. Principle of debuger
[bdt-debuger] <> [BDT-local] <> [BDT-remote]

BDT-local: Local program with BDT Stack
BDT-remote: Remote program with BDT Stack
bdt-debuger: Local program send command to BDT-local

Steps:
(1) BDT open debug mode;
(2) Run the bdt-debuger send command to BDT-local;
(3) BDT-local excute the command and return result to bdt-debuger;
(4) bdt-debuger show the results;

# 2. bdt-debuger commands
Test environment:

Two hosts running the program with BDT stack, one host running the SN service;
Remote host’s IP is 10.10.10.100;
Local host’s IP is 192.168.100.2, have remote host’s and SN’s device desc 10.10.10.100.desc/sn-miner.desc;
SN’s IP is 10.10.10.1;
Local host can access remote host and SN;

## (1) ping
Example: local host ping remote host by BDT, try 5 times, each ping’s timeout is 3 seconds.

Format:
```
./bdt-debuger -h [local_address] -p [local_port] ping [remote_desc] [count] [timeout]
```

Command:
```
./bdt-debuger -h 127.0.0.1 -p 12345 ping 10.10.10.100.desc 5 3
```

Results:
```
send ping.
respose. time: 0.7 ms
send ping.
respose. time: 0.4 ms
send ping.
respose. time: 0.4 ms
send ping.
respose. time: 0.5 ms
send ping.
respose. time: 0.4 ms
```

## (2) Check SN connection
Example: Check SN connection state, 3 secons timeout.

Format：
```
./bdt-debuger -h [local_address] -p [local_port] sn_conn_status [timeout]
```

Command：
```
./bdt-debuger -h 127.0.0.1 -p 12345 sn_conn_status 3
```

Results：
SN connection success:
```
Ok: sn connected
```
SN connection fail:
```
Err: sn connect timeout
```

## (3) nc
Example: Connect remote host’s BDT 2021 VPort.

Format:
```
./bdt-debuger -h [local_address] -p [local_port] nc [remote_desc] [port]
```

Command:
```
./bdt-debuger -h 127.0.0.1 -p 12345 nc 10.10.10.100.desc 2021
```

Results:
Connection success:
```
connecting stream
Ok: stream connected
```
Connection fail:
```
connecting stream
Err: stream not established
```

## (4) Post a chunk
Example: Post a 4MB’s chunk to BDT stack, for other host to download.

Format: 
```
./bdt-debuger -h [local_address] -p [local_port] put_chunk [chunk_file]
```

Command: 
```
./bdt-debuger -h 127.0.0.1 -p 12345 put_chunk ./4m
```

Results: 
```
put chunk success. chunk_id: 7C8WXUGziEBX6smSziPyhDaAdkKxMBsb1tDkgEjvXT7R
```

PS, get the file’s md5 value:
```
md5sum ./4m 
b5cfa9d6c8febd618f91ac2843d50a1c  ./4m
```

## (5) Download a chunk
Example: Download chunk from remote host, and save as 4m.test, 3 seconds timeout.

Format: 
```
./bdt-debuger -h [local_address] -p [local_port] get_chunk [remote_desc] [timeout] [chunk] [local_file]
```

Command:
```
./bdt-debuger -h 127.0.0.1 -p 12345 get_chunk 10.10.10.100.desc 3 7C8WXUGziEBX6smSziPyhDaAdkKxMBsb1tDkgEjvXT7R ./4m.test
```

Results: 
```
start downloading chunk..
waiting..
download chunk finish.
size: 4 MB
cost: 1.1 s
speed: 29.6 Mbps
```

PS, get the file’s md5 value:
```
md5sum 4m.test
b5cfa9d6c8febd618f91ac2843d50a1c  4m.test
```

The md5sum equal with (4), download success.

## (6) Post a file
Example: Post a 50MB’s file to BDT stack, for other host to download.

Format: 
```
./bdt-debuger -h [local_address] -p [local_port] put_file [file]
```

Command: 
```
./bdt-debuger -h 127.0.0.1 -p 12345 put_file ./50m
```

Results:
```
calculate chunkid by file..
put file sucess. file_id: 0008080200000000000000000000000000000000000000000000000000000000000000000000002800000000032000008565a714dca840f8652c5bae9249ab05f5fb5a4f9f13fbe23304b10f68252da200002f3ecc65d20e3e000140ad0aaa0112205c0000a000e5b844cc57f57094ea4585e235f36c78c1cd222262bb89d53c94dc12205c0000a000e5b844cc57f57094ea4585e235f36c78c1cd222262bb89d53c94dc12205c0000a000e5b844cc57f57094ea4585e235f36c78c1cd222262bb89d53c94dc12205c0000a000e5b844cc57f57094ea4585e235f36c78c1cd222262bb89d53c94dc12205c0000a000e5b844cc57f57094ea4585e235f36c78c1cd222262bb89d53c94dc
```

## (7) Download a file
Example: Download a file from remote host, and save as 50mb.test, 10 seconds timeout.

Format: 
```
./bdt-debuger -h [local_address] -p [local_port] get_file [remote_desc] [timeout] [file_id] [local_file]
```

Command: 
```
./bdt-debuger -h 127.0.0.1 -p 12345 get_file 10.10.10.100.desc 10 0008080200000000000000000000000000000000000000000000000000000000000000000000002800000000032000008565a714dca840f8652c5bae9249ab05f5fb5a4f9f13fbe23304b10f68252da200002f3ecc65d20e3e000140ad0aaa0112205c0000a000e5b844cc57f57094ea4585e235f36c78c1cd222262bb89d53c94dc12205c0000a000e5b844cc57f57094ea4585e235f36c78c1cd222262bb89d53c94dc12205c0000a000e5b844cc57f57094ea4585e235f36c78c1cd222262bb89d53c94dc12205c0000a000e5b844cc57f57094ea4585e235f36c78c1cd222262bb89d53c94dc12205c0000a000e5b844cc57f57094ea4585e235f36c78c1cd222262bb89d53c94dc ./50m.test
```

Results: 
```
start downloading file..
waitting..
download file finish.**
```

# 3、bdt-debuger-deamon
All functions of the BDT protocol stack are integrated, and the debug mode is turned on.
It can be run separately to debug the BDT protocol stack of remote devices

Format: 
```
./bdt-debuger-deamon --listen [Steam Vport] --port [Debuger Port] --ep [BDT Service Address] --sn [sn-miner.desc]
```

Command: 
```
./bdt-debuger-deamon --listen 2023 --port 12345 --ep L4udp10.10.10.1:8060 --sn sn1.desc --sn sn2.desc
```

You can set multiple SNs through --sn option. If not configured, sn-miner.desc in the same directory will be used by default.
